GopalSaraf/Practicals/PSDL/include/proc/pic18f2680.inc
// Register: B5D0
#define B5D0 B5D0
B5D0                                     equ 0E76h
// bitfield definitions
B5D0_B5D00_POSN                          equ 0000h
B5D0_B5D00_POSITION                      equ 0000h
B5D0_B5D00_SIZE                          equ 0001h
B5D0_B5D00_LENGTH                        equ 0001h
B5D0_B5D00_MASK                          equ 0001h
B5D0_B5D01_POSN                          equ 0001h
B5D0_B5D01_POSITION                      equ 0001h
B5D0_B5D01_SIZE                          equ 0001h
B5D0_B5D01_LENGTH                        equ 0001h
B5D0_B5D01_MASK                          equ 0002h
B5D0_B5D02_POSN                          equ 0002h
B5D0_B5D02_POSITION                      equ 0002h
B5D0_B5D02_SIZE                          equ 0001h
B5D0_B5D02_LENGTH                        equ 0001h
B5D0_B5D02_MASK                          equ 0004h
B5D0_B5D03_POSN                          equ 0003h
B5D0_B5D03_POSITION                      equ 0003h
B5D0_B5D03_SIZE                          equ 0001h
B5D0_B5D03_LENGTH                        equ 0001h
B5D0_B5D03_MASK                          equ 0008h
B5D0_B5D04_POSN                          equ 0004h
B5D0_B5D04_POSITION                      equ 0004h
B5D0_B5D04_SIZE                          equ 0001h
B5D0_B5D04_LENGTH                        equ 0001h
B5D0_B5D04_MASK                          equ 0010h
B5D0_B5D05_POSN                          equ 0005h
B5D0_B5D05_POSITION                      equ 0005h
B5D0_B5D05_SIZE                          equ 0001h
B5D0_B5D05_LENGTH                        equ 0001h
B5D0_B5D05_MASK                          equ 0020h
B5D0_B5D06_POSN                          equ 0006h
B5D0_B5D06_POSITION                      equ 0006h
B5D0_B5D06_SIZE                          equ 0001h
B5D0_B5D06_LENGTH                        equ 0001h
B5D0_B5D06_MASK                          equ 0040h
B5D0_B5D07_POSN                          equ 0007h
B5D0_B5D07_POSITION                      equ 0007h
B5D0_B5D07_SIZE                          equ 0001h
B5D0_B5D07_LENGTH                        equ 0001h
B5D0_B5D07_MASK                          equ 0080h
B5D0_B57D07_POSN                         equ 0007h
B5D0_B57D07_POSITION                     equ 0007h
B5D0_B57D07_SIZE                         equ 0001h
B5D0_B57D07_LENGTH                       equ 0001h
B5D0_B57D07_MASK                         equ 0080h

// Register: B5D1
#define B5D1 B5D1
B5D1                                     equ 0E77h
// bitfield definitions
B5D1_B5D10_POSN                          equ 0000h
B5D1_B5D10_POSITION                      equ 0000h
B5D1_B5D10_SIZE                          equ 0001h
B5D1_B5D10_LENGTH                        equ 0001h
B5D1_B5D10_MASK                          equ 0001h
B5D1_B5D11_POSN                          equ 0001h
B5D1_B5D11_POSITION                      equ 0001h
B5D1_B5D11_SIZE                          equ 0001h
B5D1_B5D11_LENGTH                        equ 0001h
B5D1_B5D11_MASK                          equ 0002h
B5D1_B5D12_POSN                          equ 0002h
B5D1_B5D12_POSITION                      equ 0002h
B5D1_B5D12_SIZE                          equ 0001h
B5D1_B5D12_LENGTH                        equ 0001h
B5D1_B5D12_MASK                          equ 0004h
B5D1_B5D13_POSN                          equ 0003h
B5D1_B5D13_POSITION                      equ 0003h
B5D1_B5D13_SIZE                          equ 0001h
B5D1_B5D13_LENGTH                        equ 0001h
B5D1_B5D13_MASK                          equ 0008h
B5D1_B5D14_POSN                          equ 0004h
B5D1_B5D14_POSITION                      equ 0004h
B5D1_B5D14_SIZE                          equ 0001h
B5D1_B5D14_LENGTH                        equ 0001h
B5D1_B5D14_MASK                          equ 0010h
B5D1_B5D15_POSN                          equ 0005h
B5D1_B5D15_POSITION                      equ 0005h
B5D1_B5D15_SIZE                          equ 0001h
B5D1_B5D15_LENGTH                        equ 0001h
B5D1_B5D15_MASK                          equ 0020h
B5D1_B5D16_POSN                          equ 0006h
B5D1_B5D16_POSITION                      equ 0006h
B5D1_B5D16_SIZE                          equ 0001h
B5D1_B5D16_LENGTH                        equ 0001h
B5D1_B5D16_MASK                          equ 0040h
B5D1_B5D17_POSN                          equ 0007h
B5D1_B5D17_POSITION                      equ 0007h
B5D1_B5D17_SIZE                          equ 0001h
B5D1_B5D17_LENGTH                        equ 0001h
B5D1_B5D17_MASK                          equ 0080h

// Register: B5D2
#define B5D2 B5D2
B5D2                                     equ 0E78h
// bitfield definitions
B5D2_B5D20_POSN                          equ 0000h
B5D2_B5D20_POSITION                      equ 0000h
B5D2_B5D20_SIZE                          equ 0001h
B5D2_B5D20_LENGTH                        equ 0001h
B5D2_B5D20_MASK                          equ 0001h
B5D2_B5D21_POSN                          equ 0001h
B5D2_B5D21_POSITION                      equ 0001h
B5D2_B5D21_SIZE                          equ 0001h
B5D2_B5D21_LENGTH                        equ 0001h
B5D2_B5D21_MASK                          equ 0002h
B5D2_B5D22_POSN                          equ 0002h
B5D2_B5D22_POSITION                      equ 0002h
B5D2_B5D22_SIZE                          equ 0001h
B5D2_B5D22_LENGTH                        equ 0001h
B5D2_B5D22_MASK                          equ 0004h
B5D2_B5D23_POSN                          equ 0003h
B5D2_B5D23_POSITION                      equ 0003h
B5D2_B5D23_SIZE                          equ 0001h
B5D2_B5D23_LENGTH                        equ 0001h
B5D2_B5D23_MASK                          equ 0008h
B5D2_B5D24_POSN                          equ 0004h
B5D2_B5D24_POSITION                      equ 0004h
B5D2_B5D24_SIZE                          equ 0001h
B5D2_B5D24_LENGTH                        equ 0001h
B5D2_B5D24_MASK                          equ 0010h
B5D2_B5D25_POSN                          equ 0005h
B5D2_B5D25_POSITION                      equ 0005h
B5D2_B5D25_SIZE                          equ 0001h
B5D2_B5D25_LENGTH                        equ 0001h
B5D2_B5D25_MASK                          equ 0020h
B5D2_B5D26_POSN                          equ 0006h
B5D2_B5D26_POSITION                      equ 0006h
B5D2_B5D26_SIZE                          equ 0001h
B5D2_B5D26_LENGTH                        equ 0001h
B5D2_B5D26_MASK                          equ 0040h
B5D2_B5D27_POSN                          equ 0007h
B5D2_B5D27_POSITION                      equ 0007h
B5D2_B5D27_SIZE                          equ 0001h
B5D2_B5D27_LENGTH                        equ 0001h
B5D2_B5D27_MASK                          equ 0080h
B5D2_B57D23_POSN                         equ 0003h
B5D2_B57D23_POSITION                     equ 0003h
B5D2_B57D23_SIZE                         equ 0001h
B5D2_B57D23_LENGTH                       equ 0001h
B5D2_B57D23_MASK                         equ 0008h

// Register: B5D3
#define B5D3 B5D3
B5D3                                     equ 0E79h
// bitfield definitions
B5D3_B5D30_POSN                          equ 0000h
B5D3_B5D30_POSITION                      equ 0000h
B5D3_B5D30_SIZE                          equ 0001h
B5D3_B5D30_LENGTH                        equ 0001h
B5D3_B5D30_MASK                          equ 0001h
B5D3_B5D31_POSN                          equ 0001h
B5D3_B5D31_POSITION                      equ 0001h
B5D3_B5D31_SIZE                          equ 0001h
B5D3_B5D31_LENGTH                        equ 0001h
B5D3_B5D31_MASK                          equ 0002h
B5D3_B5D32_POSN                          equ 0002h
B5D3_B5D32_POSITION                      equ 0002h
B5D3_B5D32_SIZE                          equ 0001h
B5D3_B5D32_LENGTH                        equ 0001h
B5D3_B5D32_MASK                          equ 0004h
B5D3_B5D33_POSN                          equ 0003h
B5D3_B5D33_POSITION                      equ 0003h
B5D3_B5D33_SIZE                          equ 0001h
B5D3_B5D33_LENGTH                        equ 0001h
B5D3_B5D33_MASK                          equ 0008h
B5D3_B5D34_POSN                          equ 0004h
B5D3_B5D34_POSITION                      equ 0004h
B5D3_B5D34_SIZE                          equ 0001h
B5D3_B5D34_LENGTH                        equ 0001h
B5D3_B5D34_MASK                          equ 0010h
B5D3_B5D35_POSN                          equ 0005h
B5D3_B5D35_POSITION                      equ 0005h
B5D3_B5D35_SIZE                          equ 0001h
B5D3_B5D35_LENGTH                        equ 0001h
B5D3_B5D35_MASK                          equ 0020h
B5D3_B5D36_POSN                          equ 0006h
B5D3_B5D36_POSITION                      equ 0006h
B5D3_B5D36_SIZE                          equ 0001h
B5D3_B5D36_LENGTH                        equ 0001h
B5D3_B5D36_MASK                          equ 0040h
B5D3_B5D37_POSN                          equ 0007h
B5D3_B5D37_POSITION                      equ 0007h
B5D3_B5D37_SIZE                          equ 0001h
B5D3_B5D37_LENGTH                        equ 0001h
B5D3_B5D37_MASK                          equ 0080h

// Register: B5D4
#define B5D4 B5D4
B5D4                                     equ 0E7Ah
// bitfield definitions
B5D4_B5D40_POSN                          equ 0000h
B5D4_B5D40_POSITION                      equ 0000h
B5D4_B5D40_SIZE                          equ 0001h
B5D4_B5D40_LENGTH                        equ 0001h
B5D4_B5D40_MASK                          equ 0001h
B5D4_B5D41_POSN                          equ 0001h
B5D4_B5D41_POSITION                      equ 0001h
B5D4_B5D41_SIZE                          equ 0001h
B5D4_B5D41_LENGTH                        equ 0001h
B5D4_B5D41_MASK                          equ 0002h
B5D4_B5D42_POSN                          equ 0002h
B5D4_B5D42_POSITION                      equ 0002h
B5D4_B5D42_SIZE                          equ 0001h
B5D4_B5D42_LENGTH                        equ 0001h
B5D4_B5D42_MASK                          equ 0004h
B5D4_B5D43_POSN                          equ 0003h
B5D4_B5D43_POSITION                      equ 0003h
B5D4_B5D43_SIZE                          equ 0001h
B5D4_B5D43_LENGTH                        equ 0001h
B5D4_B5D43_MASK                          equ 0008h
B5D4_B5D44_POSN                          equ 0004h
B5D4_B5D44_POSITION                      equ 0004h
B5D4_B5D44_SIZE                          equ 0001h
B5D4_B5D44_LENGTH                        equ 0001h
B5D4_B5D44_MASK                          equ 0010h
B5D4_B5D45_POSN                          equ 0005h
B5D4_B5D45_POSITION                      equ 0005h
B5D4_B5D45_SIZE                          equ 0001h
B5D4_B5D45_LENGTH                        equ 0001h
B5D4_B5D45_MASK                          equ 0020h
B5D4_B5D46_POSN                          equ 0006h
B5D4_B5D46_POSITION                      equ 0006h
B5D4_B5D46_SIZE                          equ 0001h
B5D4_B5D46_LENGTH                        equ 0001h
B5D4_B5D46_MASK                          equ 0040h
B5D4_B5D47_POSN                          equ 0007h
B5D4_B5D47_POSITION                      equ 0007h
B5D4_B5D47_SIZE                          equ 0001h
B5D4_B5D47_LENGTH                        equ 0001h
B5D4_B5D47_MASK                          equ 0080h

// Register: B5D5
#define B5D5 B5D5
B5D5                                     equ 0E7Bh
// bitfield definitions
B5D5_B5D50_POSN                          equ 0000h
B5D5_B5D50_POSITION                      equ 0000h
B5D5_B5D50_SIZE                          equ 0001h
B5D5_B5D50_LENGTH                        equ 0001h
B5D5_B5D50_MASK                          equ 0001h
B5D5_B5D51_POSN                          equ 0001h
B5D5_B5D51_POSITION                      equ 0001h
B5D5_B5D51_SIZE                          equ 0001h
B5D5_B5D51_LENGTH                        equ 0001h
B5D5_B5D51_MASK                          equ 0002h
B5D5_B5D52_POSN                          equ 0002h
B5D5_B5D52_POSITION                      equ 0002h
B5D5_B5D52_SIZE                          equ 0001h
B5D5_B5D52_LENGTH                        equ 0001h
B5D5_B5D52_MASK                          equ 0004h
B5D5_B5D53_POSN                          equ 0003h
B5D5_B5D53_POSITION                      equ 0003h
B5D5_B5D53_SIZE                          equ 0001h
B5D5_B5D53_LENGTH                        equ 0001h
B5D5_B5D53_MASK                          equ 0008h
B5D5_B5D54_POSN                          equ 0004h
B5D5_B5D54_POSITION                      equ 0004h
B5D5_B5D54_SIZE                          equ 0001h
B5D5_B5D54_LENGTH                        equ 0001h
B5D5_B5D54_MASK                          equ 0010h
B5D5_B5D55_POSN                          equ 0005h
B5D5_B5D55_POSITION                      equ 0005h
B5D5_B5D55_SIZE                          equ 0001h
B5D5_B5D55_LENGTH                        equ 0001h
B5D5_B5D55_MASK                          equ 0020h
B5D5_B5D56_POSN                          equ 0006h
B5D5_B5D56_POSITION                      equ 0006h
B5D5_B5D56_SIZE                          equ 0001h
B5D5_B5D56_LENGTH                        equ 0001h
B5D5_B5D56_MASK                          equ 0040h
B5D5_B5D57_POSN                          equ 0007h
B5D5_B5D57_POSITION                      equ 0007h
B5D5_B5D57_SIZE                          equ 0001h
B5D5_B5D57_LENGTH                        equ 0001h
B5D5_B5D57_MASK                          equ 0080h

// Register: B5D6
#define B5D6 B5D6
B5D6                                     equ 0E7Ch
// bitfield definitions
B5D6_B5D60_POSN                          equ 0000h
B5D6_B5D60_POSITION                      equ 0000h
B5D6_B5D60_SIZE                          equ 0001h
B5D6_B5D60_LENGTH                        equ 0001h
B5D6_B5D60_MASK                          equ 0001h
B5D6_B5D61_POSN                          equ 0001h
B5D6_B5D61_POSITION                      equ 0001h
B5D6_B5D61_SIZE                          equ 0001h
B5D6_B5D61_LENGTH                        equ 0001h
B5D6_B5D61_MASK                          equ 0002h
B5D6_B5D62_POSN                          equ 0002h
B5D6_B5D62_POSITION                      equ 0002h
B5D6_B5D62_SIZE                          equ 0001h
B5D6_B5D62_LENGTH                        equ 0001h
B5D6_B5D62_MASK                          equ 0004h
B5D6_B5D63_POSN                          equ 0003h
B5D6_B5D63_POSITION                      equ 0003h
B5D6_B5D63_SIZE                          equ 0001h
B5D6_B5D63_LENGTH                        equ 0001h
B5D6_B5D63_MASK                          equ 0008h
B5D6_B5D64_POSN                          equ 0004h
B5D6_B5D64_POSITION                      equ 0004h
B5D6_B5D64_SIZE                          equ 0001h
B5D6_B5D64_LENGTH                        equ 0001h
B5D6_B5D64_MASK                          equ 0010h
B5D6_B5D65_POSN                          equ 0005h
B5D6_B5D65_POSITION                      equ 0005h
B5D6_B5D65_SIZE                          equ 0001h
B5D6_B5D65_LENGTH                        equ 0001h
B5D6_B5D65_MASK                          equ 0020h
B5D6_B5D66_POSN                          equ 0006h
B5D6_B5D66_POSITION                      equ 0006h
B5D6_B5D66_SIZE                          equ 0001h
B5D6_B5D66_LENGTH                        equ 0001h
B5D6_B5D66_MASK                          equ 0040h
B5D6_B5D67_POSN                          equ 0007h
B5D6_B5D67_POSITION                      equ 0007h
B5D6_B5D67_SIZE                          equ 0001h
B5D6_B5D67_LENGTH                        equ 0001h
B5D6_B5D67_MASK                          equ 0080h

// Register: B5D7
#define B5D7 B5D7
B5D7                                     equ 0E7Dh
// bitfield definitions
B5D7_B5D70_POSN                          equ 0000h
B5D7_B5D70_POSITION                      equ 0000h
B5D7_B5D70_SIZE                          equ 0001h
B5D7_B5D70_LENGTH                        equ 0001h
B5D7_B5D70_MASK                          equ 0001h
B5D7_B5D71_POSN                          equ 0001h
B5D7_B5D71_POSITION                      equ 0001h
B5D7_B5D71_SIZE                          equ 0001h
B5D7_B5D71_LENGTH                        equ 0001h
B5D7_B5D71_MASK                          equ 0002h
B5D7_B5D72_POSN                          equ 0002h
B5D7_B5D72_POSITION                      equ 0002h
B5D7_B5D72_SIZE                          equ 0001h
B5D7_B5D72_LENGTH                        equ 0001h
B5D7_B5D72_MASK                          equ 0004h
B5D7_B5D73_POSN                          equ 0003h
B5D7_B5D73_POSITION                      equ 0003h
B5D7_B5D73_SIZE                          equ 0001h
B5D7_B5D73_LENGTH                        equ 0001h
B5D7_B5D73_MASK                          equ 0008h
B5D7_B5D74_POSN                          equ 0004h
B5D7_B5D74_POSITION                      equ 0004h
B5D7_B5D74_SIZE                          equ 0001h
B5D7_B5D74_LENGTH                        equ 0001h
B5D7_B5D74_MASK                          equ 0010h
B5D7_B5D75_POSN                          equ 0005h
B5D7_B5D75_POSITION                      equ 0005h
B5D7_B5D75_SIZE                          equ 0001h
B5D7_B5D75_LENGTH                        equ 0001h
B5D7_B5D75_MASK                          equ 0020h
B5D7_B5D76_POSN                          equ 0006h
B5D7_B5D76_POSITION                      equ 0006h
B5D7_B5D76_SIZE                          equ 0001h
B5D7_B5D76_LENGTH                        equ 0001h
B5D7_B5D76_MASK                          equ 0040h
B5D7_B5D77_POSN                          equ 0007h
B5D7_B5D77_POSITION                      equ 0007h
B5D7_B5D77_SIZE                          equ 0001h
B5D7_B5D77_LENGTH                        equ 0001h
B5D7_B5D77_MASK                          equ 0080h

// Register: CANSTAT_RO4
#define CANSTAT_RO4 CANSTAT_RO4
CANSTAT_RO4                              equ 0E7Eh
// bitfield definitions
CANSTAT_RO4_EICODE0_POSN                 equ 0000h
CANSTAT_RO4_EICODE0_POSITION             equ 0000h
CANSTAT_RO4_EICODE0_SIZE                 equ 0001h
CANSTAT_RO4_EICODE0_LENGTH               equ 0001h
CANSTAT_RO4_EICODE0_MASK                 equ 0001h
CANSTAT_RO4_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO4_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO4_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO4_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO4_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO4_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO4_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO4_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO4_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO4_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO4_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO4_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO4_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO4_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO4_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO4_EICODE4_POSN                 equ 0004h
CANSTAT_RO4_EICODE4_POSITION             equ 0004h
CANSTAT_RO4_EICODE4_SIZE                 equ 0001h
CANSTAT_RO4_EICODE4_LENGTH               equ 0001h
CANSTAT_RO4_EICODE4_MASK                 equ 0010h
CANSTAT_RO4_OPMODE0_POSN                 equ 0005h
CANSTAT_RO4_OPMODE0_POSITION             equ 0005h
CANSTAT_RO4_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO4_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO4_OPMODE0_MASK                 equ 0020h
CANSTAT_RO4_OPMODE1_POSN                 equ 0006h
CANSTAT_RO4_OPMODE1_POSITION             equ 0006h
CANSTAT_RO4_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO4_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO4_OPMODE1_MASK                 equ 0040h
CANSTAT_RO4_OPMODE2_POSN                 equ 0007h
CANSTAT_RO4_OPMODE2_POSITION             equ 0007h
CANSTAT_RO4_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO4_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO4_OPMODE2_MASK                 equ 0080h
CANSTAT_RO4_ICODE0_POSN                  equ 0000h
CANSTAT_RO4_ICODE0_POSITION              equ 0000h
CANSTAT_RO4_ICODE0_SIZE                  equ 0001h
CANSTAT_RO4_ICODE0_LENGTH                equ 0001h
CANSTAT_RO4_ICODE0_MASK                  equ 0001h
CANSTAT_RO4_ICODE1_POSN                  equ 0001h
CANSTAT_RO4_ICODE1_POSITION              equ 0001h
CANSTAT_RO4_ICODE1_SIZE                  equ 0001h
CANSTAT_RO4_ICODE1_LENGTH                equ 0001h
CANSTAT_RO4_ICODE1_MASK                  equ 0002h
CANSTAT_RO4_ICODE2_POSN                  equ 0002h
CANSTAT_RO4_ICODE2_POSITION              equ 0002h
CANSTAT_RO4_ICODE2_SIZE                  equ 0001h
CANSTAT_RO4_ICODE2_LENGTH                equ 0001h
CANSTAT_RO4_ICODE2_MASK                  equ 0004h
CANSTAT_RO4_ICODE3_POSN                  equ 0003h
CANSTAT_RO4_ICODE3_POSITION              equ 0003h
CANSTAT_RO4_ICODE3_SIZE                  equ 0001h
CANSTAT_RO4_ICODE3_LENGTH                equ 0001h
CANSTAT_RO4_ICODE3_MASK                  equ 0008h
CANSTAT_RO4_ICODE4_POSN                  equ 0004h
CANSTAT_RO4_ICODE4_POSITION              equ 0004h
CANSTAT_RO4_ICODE4_SIZE                  equ 0001h
CANSTAT_RO4_ICODE4_LENGTH                equ 0001h
CANSTAT_RO4_ICODE4_MASK                  equ 0010h

