GopalSaraf/Practicals/PSDL/include/proc/pic18f2680.inc
// Register: RXF3SIDH
#define RXF3SIDH RXF3SIDH
RXF3SIDH                                 equ 0F0Ch
// bitfield definitions
RXF3SIDH_SID3_POSN                       equ 0000h
RXF3SIDH_SID3_POSITION                   equ 0000h
RXF3SIDH_SID3_SIZE                       equ 0001h
RXF3SIDH_SID3_LENGTH                     equ 0001h
RXF3SIDH_SID3_MASK                       equ 0001h
RXF3SIDH_SID4_POSN                       equ 0001h
RXF3SIDH_SID4_POSITION                   equ 0001h
RXF3SIDH_SID4_SIZE                       equ 0001h
RXF3SIDH_SID4_LENGTH                     equ 0001h
RXF3SIDH_SID4_MASK                       equ 0002h
RXF3SIDH_SID5_POSN                       equ 0002h
RXF3SIDH_SID5_POSITION                   equ 0002h
RXF3SIDH_SID5_SIZE                       equ 0001h
RXF3SIDH_SID5_LENGTH                     equ 0001h
RXF3SIDH_SID5_MASK                       equ 0004h
RXF3SIDH_SID6_POSN                       equ 0003h
RXF3SIDH_SID6_POSITION                   equ 0003h
RXF3SIDH_SID6_SIZE                       equ 0001h
RXF3SIDH_SID6_LENGTH                     equ 0001h
RXF3SIDH_SID6_MASK                       equ 0008h
RXF3SIDH_SID7_POSN                       equ 0004h
RXF3SIDH_SID7_POSITION                   equ 0004h
RXF3SIDH_SID7_SIZE                       equ 0001h
RXF3SIDH_SID7_LENGTH                     equ 0001h
RXF3SIDH_SID7_MASK                       equ 0010h
RXF3SIDH_SID8_POSN                       equ 0005h
RXF3SIDH_SID8_POSITION                   equ 0005h
RXF3SIDH_SID8_SIZE                       equ 0001h
RXF3SIDH_SID8_LENGTH                     equ 0001h
RXF3SIDH_SID8_MASK                       equ 0020h
RXF3SIDH_SID9_POSN                       equ 0006h
RXF3SIDH_SID9_POSITION                   equ 0006h
RXF3SIDH_SID9_SIZE                       equ 0001h
RXF3SIDH_SID9_LENGTH                     equ 0001h
RXF3SIDH_SID9_MASK                       equ 0040h
RXF3SIDH_SID10_POSN                      equ 0007h
RXF3SIDH_SID10_POSITION                  equ 0007h
RXF3SIDH_SID10_SIZE                      equ 0001h
RXF3SIDH_SID10_LENGTH                    equ 0001h
RXF3SIDH_SID10_MASK                      equ 0080h
RXF3SIDH_RXF3SID3_POSN                   equ 0000h
RXF3SIDH_RXF3SID3_POSITION               equ 0000h
RXF3SIDH_RXF3SID3_SIZE                   equ 0001h
RXF3SIDH_RXF3SID3_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID3_MASK                   equ 0001h
RXF3SIDH_RXF3SID4_POSN                   equ 0001h
RXF3SIDH_RXF3SID4_POSITION               equ 0001h
RXF3SIDH_RXF3SID4_SIZE                   equ 0001h
RXF3SIDH_RXF3SID4_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID4_MASK                   equ 0002h
RXF3SIDH_RXF3SID5_POSN                   equ 0002h
RXF3SIDH_RXF3SID5_POSITION               equ 0002h
RXF3SIDH_RXF3SID5_SIZE                   equ 0001h
RXF3SIDH_RXF3SID5_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID5_MASK                   equ 0004h
RXF3SIDH_RXF3SID6_POSN                   equ 0003h
RXF3SIDH_RXF3SID6_POSITION               equ 0003h
RXF3SIDH_RXF3SID6_SIZE                   equ 0001h
RXF3SIDH_RXF3SID6_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID6_MASK                   equ 0008h
RXF3SIDH_RXF3SID7_POSN                   equ 0004h
RXF3SIDH_RXF3SID7_POSITION               equ 0004h
RXF3SIDH_RXF3SID7_SIZE                   equ 0001h
RXF3SIDH_RXF3SID7_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID7_MASK                   equ 0010h
RXF3SIDH_RXF3SID8_POSN                   equ 0005h
RXF3SIDH_RXF3SID8_POSITION               equ 0005h
RXF3SIDH_RXF3SID8_SIZE                   equ 0001h
RXF3SIDH_RXF3SID8_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID8_MASK                   equ 0020h
RXF3SIDH_RXF3SID9_POSN                   equ 0006h
RXF3SIDH_RXF3SID9_POSITION               equ 0006h
RXF3SIDH_RXF3SID9_SIZE                   equ 0001h
RXF3SIDH_RXF3SID9_LENGTH                 equ 0001h
RXF3SIDH_RXF3SID9_MASK                   equ 0040h
RXF3SIDH_RXF3SID10_POSN                  equ 0007h
RXF3SIDH_RXF3SID10_POSITION              equ 0007h
RXF3SIDH_RXF3SID10_SIZE                  equ 0001h
RXF3SIDH_RXF3SID10_LENGTH                equ 0001h
RXF3SIDH_RXF3SID10_MASK                  equ 0080h

// Register: RXF3SIDL
#define RXF3SIDL RXF3SIDL
RXF3SIDL                                 equ 0F0Dh
// bitfield definitions
RXF3SIDL_EID16_POSN                      equ 0000h
RXF3SIDL_EID16_POSITION                  equ 0000h
RXF3SIDL_EID16_SIZE                      equ 0001h
RXF3SIDL_EID16_LENGTH                    equ 0001h
RXF3SIDL_EID16_MASK                      equ 0001h
RXF3SIDL_EID17_POSN                      equ 0001h
RXF3SIDL_EID17_POSITION                  equ 0001h
RXF3SIDL_EID17_SIZE                      equ 0001h
RXF3SIDL_EID17_LENGTH                    equ 0001h
RXF3SIDL_EID17_MASK                      equ 0002h
RXF3SIDL_EXIDEN_POSN                     equ 0003h
RXF3SIDL_EXIDEN_POSITION                 equ 0003h
RXF3SIDL_EXIDEN_SIZE                     equ 0001h
RXF3SIDL_EXIDEN_LENGTH                   equ 0001h
RXF3SIDL_EXIDEN_MASK                     equ 0008h
RXF3SIDL_SID0_POSN                       equ 0005h
RXF3SIDL_SID0_POSITION                   equ 0005h
RXF3SIDL_SID0_SIZE                       equ 0001h
RXF3SIDL_SID0_LENGTH                     equ 0001h
RXF3SIDL_SID0_MASK                       equ 0020h
RXF3SIDL_SID1_POSN                       equ 0006h
RXF3SIDL_SID1_POSITION                   equ 0006h
RXF3SIDL_SID1_SIZE                       equ 0001h
RXF3SIDL_SID1_LENGTH                     equ 0001h
RXF3SIDL_SID1_MASK                       equ 0040h
RXF3SIDL_SID2_POSN                       equ 0007h
RXF3SIDL_SID2_POSITION                   equ 0007h
RXF3SIDL_SID2_SIZE                       equ 0001h
RXF3SIDL_SID2_LENGTH                     equ 0001h
RXF3SIDL_SID2_MASK                       equ 0080h
RXF3SIDL_EXIDE_POSN                      equ 0003h
RXF3SIDL_EXIDE_POSITION                  equ 0003h
RXF3SIDL_EXIDE_SIZE                      equ 0001h
RXF3SIDL_EXIDE_LENGTH                    equ 0001h
RXF3SIDL_EXIDE_MASK                      equ 0008h
RXF3SIDL_RXF3EID16_POSN                  equ 0000h
RXF3SIDL_RXF3EID16_POSITION              equ 0000h
RXF3SIDL_RXF3EID16_SIZE                  equ 0001h
RXF3SIDL_RXF3EID16_LENGTH                equ 0001h
RXF3SIDL_RXF3EID16_MASK                  equ 0001h
RXF3SIDL_RXF3EID17_POSN                  equ 0001h
RXF3SIDL_RXF3EID17_POSITION              equ 0001h
RXF3SIDL_RXF3EID17_SIZE                  equ 0001h
RXF3SIDL_RXF3EID17_LENGTH                equ 0001h
RXF3SIDL_RXF3EID17_MASK                  equ 0002h
RXF3SIDL_RXF3EXIDEN_POSN                 equ 0003h
RXF3SIDL_RXF3EXIDEN_POSITION             equ 0003h
RXF3SIDL_RXF3EXIDEN_SIZE                 equ 0001h
RXF3SIDL_RXF3EXIDEN_LENGTH               equ 0001h
RXF3SIDL_RXF3EXIDEN_MASK                 equ 0008h
RXF3SIDL_RXF3SID0_POSN                   equ 0005h
RXF3SIDL_RXF3SID0_POSITION               equ 0005h
RXF3SIDL_RXF3SID0_SIZE                   equ 0001h
RXF3SIDL_RXF3SID0_LENGTH                 equ 0001h
RXF3SIDL_RXF3SID0_MASK                   equ 0020h
RXF3SIDL_RXF3SID1_POSN                   equ 0006h
RXF3SIDL_RXF3SID1_POSITION               equ 0006h
RXF3SIDL_RXF3SID1_SIZE                   equ 0001h
RXF3SIDL_RXF3SID1_LENGTH                 equ 0001h
RXF3SIDL_RXF3SID1_MASK                   equ 0040h
RXF3SIDL_RXF3SID2_POSN                   equ 0007h
RXF3SIDL_RXF3SID2_POSITION               equ 0007h
RXF3SIDL_RXF3SID2_SIZE                   equ 0001h
RXF3SIDL_RXF3SID2_LENGTH                 equ 0001h
RXF3SIDL_RXF3SID2_MASK                   equ 0080h

// Register: RXF3EIDH
#define RXF3EIDH RXF3EIDH
RXF3EIDH                                 equ 0F0Eh
// bitfield definitions
RXF3EIDH_EID8_POSN                       equ 0000h
RXF3EIDH_EID8_POSITION                   equ 0000h
RXF3EIDH_EID8_SIZE                       equ 0001h
RXF3EIDH_EID8_LENGTH                     equ 0001h
RXF3EIDH_EID8_MASK                       equ 0001h
RXF3EIDH_EID9_POSN                       equ 0001h
RXF3EIDH_EID9_POSITION                   equ 0001h
RXF3EIDH_EID9_SIZE                       equ 0001h
RXF3EIDH_EID9_LENGTH                     equ 0001h
RXF3EIDH_EID9_MASK                       equ 0002h
RXF3EIDH_EID10_POSN                      equ 0002h
RXF3EIDH_EID10_POSITION                  equ 0002h
RXF3EIDH_EID10_SIZE                      equ 0001h
RXF3EIDH_EID10_LENGTH                    equ 0001h
RXF3EIDH_EID10_MASK                      equ 0004h
RXF3EIDH_EID11_POSN                      equ 0003h
RXF3EIDH_EID11_POSITION                  equ 0003h
RXF3EIDH_EID11_SIZE                      equ 0001h
RXF3EIDH_EID11_LENGTH                    equ 0001h
RXF3EIDH_EID11_MASK                      equ 0008h
RXF3EIDH_EID12_POSN                      equ 0004h
RXF3EIDH_EID12_POSITION                  equ 0004h
RXF3EIDH_EID12_SIZE                      equ 0001h
RXF3EIDH_EID12_LENGTH                    equ 0001h
RXF3EIDH_EID12_MASK                      equ 0010h
RXF3EIDH_EID13_POSN                      equ 0005h
RXF3EIDH_EID13_POSITION                  equ 0005h
RXF3EIDH_EID13_SIZE                      equ 0001h
RXF3EIDH_EID13_LENGTH                    equ 0001h
RXF3EIDH_EID13_MASK                      equ 0020h
RXF3EIDH_EID14_POSN                      equ 0006h
RXF3EIDH_EID14_POSITION                  equ 0006h
RXF3EIDH_EID14_SIZE                      equ 0001h
RXF3EIDH_EID14_LENGTH                    equ 0001h
RXF3EIDH_EID14_MASK                      equ 0040h
RXF3EIDH_EID15_POSN                      equ 0007h
RXF3EIDH_EID15_POSITION                  equ 0007h
RXF3EIDH_EID15_SIZE                      equ 0001h
RXF3EIDH_EID15_LENGTH                    equ 0001h
RXF3EIDH_EID15_MASK                      equ 0080h
RXF3EIDH_RXF3EID8_POSN                   equ 0000h
RXF3EIDH_RXF3EID8_POSITION               equ 0000h
RXF3EIDH_RXF3EID8_SIZE                   equ 0001h
RXF3EIDH_RXF3EID8_LENGTH                 equ 0001h
RXF3EIDH_RXF3EID8_MASK                   equ 0001h
RXF3EIDH_RXF3EID9_POSN                   equ 0001h
RXF3EIDH_RXF3EID9_POSITION               equ 0001h
RXF3EIDH_RXF3EID9_SIZE                   equ 0001h
RXF3EIDH_RXF3EID9_LENGTH                 equ 0001h
RXF3EIDH_RXF3EID9_MASK                   equ 0002h
RXF3EIDH_RXF3EID10_POSN                  equ 0002h
RXF3EIDH_RXF3EID10_POSITION              equ 0002h
RXF3EIDH_RXF3EID10_SIZE                  equ 0001h
RXF3EIDH_RXF3EID10_LENGTH                equ 0001h
RXF3EIDH_RXF3EID10_MASK                  equ 0004h
RXF3EIDH_RXF3EID11_POSN                  equ 0003h
RXF3EIDH_RXF3EID11_POSITION              equ 0003h
RXF3EIDH_RXF3EID11_SIZE                  equ 0001h
RXF3EIDH_RXF3EID11_LENGTH                equ 0001h
RXF3EIDH_RXF3EID11_MASK                  equ 0008h
RXF3EIDH_RXF3EID12_POSN                  equ 0004h
RXF3EIDH_RXF3EID12_POSITION              equ 0004h
RXF3EIDH_RXF3EID12_SIZE                  equ 0001h
RXF3EIDH_RXF3EID12_LENGTH                equ 0001h
RXF3EIDH_RXF3EID12_MASK                  equ 0010h
RXF3EIDH_RXF3EID13_POSN                  equ 0005h
RXF3EIDH_RXF3EID13_POSITION              equ 0005h
RXF3EIDH_RXF3EID13_SIZE                  equ 0001h
RXF3EIDH_RXF3EID13_LENGTH                equ 0001h
RXF3EIDH_RXF3EID13_MASK                  equ 0020h
RXF3EIDH_RXF3EID14_POSN                  equ 0006h
RXF3EIDH_RXF3EID14_POSITION              equ 0006h
RXF3EIDH_RXF3EID14_SIZE                  equ 0001h
RXF3EIDH_RXF3EID14_LENGTH                equ 0001h
RXF3EIDH_RXF3EID14_MASK                  equ 0040h
RXF3EIDH_RXF3EID15_POSN                  equ 0007h
RXF3EIDH_RXF3EID15_POSITION              equ 0007h
RXF3EIDH_RXF3EID15_SIZE                  equ 0001h
RXF3EIDH_RXF3EID15_LENGTH                equ 0001h
RXF3EIDH_RXF3EID15_MASK                  equ 0080h

// Register: RXF3EIDL
#define RXF3EIDL RXF3EIDL
RXF3EIDL                                 equ 0F0Fh
// bitfield definitions
RXF3EIDL_EID0_POSN                       equ 0000h
RXF3EIDL_EID0_POSITION                   equ 0000h
RXF3EIDL_EID0_SIZE                       equ 0001h
RXF3EIDL_EID0_LENGTH                     equ 0001h
RXF3EIDL_EID0_MASK                       equ 0001h
RXF3EIDL_EID1_POSN                       equ 0001h
RXF3EIDL_EID1_POSITION                   equ 0001h
RXF3EIDL_EID1_SIZE                       equ 0001h
RXF3EIDL_EID1_LENGTH                     equ 0001h
RXF3EIDL_EID1_MASK                       equ 0002h
RXF3EIDL_EID2_POSN                       equ 0002h
RXF3EIDL_EID2_POSITION                   equ 0002h
RXF3EIDL_EID2_SIZE                       equ 0001h
RXF3EIDL_EID2_LENGTH                     equ 0001h
RXF3EIDL_EID2_MASK                       equ 0004h
RXF3EIDL_EID3_POSN                       equ 0003h
RXF3EIDL_EID3_POSITION                   equ 0003h
RXF3EIDL_EID3_SIZE                       equ 0001h
RXF3EIDL_EID3_LENGTH                     equ 0001h
RXF3EIDL_EID3_MASK                       equ 0008h
RXF3EIDL_EID4_POSN                       equ 0004h
RXF3EIDL_EID4_POSITION                   equ 0004h
RXF3EIDL_EID4_SIZE                       equ 0001h
RXF3EIDL_EID4_LENGTH                     equ 0001h
RXF3EIDL_EID4_MASK                       equ 0010h
RXF3EIDL_EID5_POSN                       equ 0005h
RXF3EIDL_EID5_POSITION                   equ 0005h
RXF3EIDL_EID5_SIZE                       equ 0001h
RXF3EIDL_EID5_LENGTH                     equ 0001h
RXF3EIDL_EID5_MASK                       equ 0020h
RXF3EIDL_EID6_POSN                       equ 0006h
RXF3EIDL_EID6_POSITION                   equ 0006h
RXF3EIDL_EID6_SIZE                       equ 0001h
RXF3EIDL_EID6_LENGTH                     equ 0001h
RXF3EIDL_EID6_MASK                       equ 0040h
RXF3EIDL_EID7_POSN                       equ 0007h
RXF3EIDL_EID7_POSITION                   equ 0007h
RXF3EIDL_EID7_SIZE                       equ 0001h
RXF3EIDL_EID7_LENGTH                     equ 0001h
RXF3EIDL_EID7_MASK                       equ 0080h
RXF3EIDL_RXF3EID0_POSN                   equ 0000h
RXF3EIDL_RXF3EID0_POSITION               equ 0000h
RXF3EIDL_RXF3EID0_SIZE                   equ 0001h
RXF3EIDL_RXF3EID0_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID0_MASK                   equ 0001h
RXF3EIDL_RXF3EID1_POSN                   equ 0001h
RXF3EIDL_RXF3EID1_POSITION               equ 0001h
RXF3EIDL_RXF3EID1_SIZE                   equ 0001h
RXF3EIDL_RXF3EID1_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID1_MASK                   equ 0002h
RXF3EIDL_RXF3EID2_POSN                   equ 0002h
RXF3EIDL_RXF3EID2_POSITION               equ 0002h
RXF3EIDL_RXF3EID2_SIZE                   equ 0001h
RXF3EIDL_RXF3EID2_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID2_MASK                   equ 0004h
RXF3EIDL_RXF3EID3_POSN                   equ 0003h
RXF3EIDL_RXF3EID3_POSITION               equ 0003h
RXF3EIDL_RXF3EID3_SIZE                   equ 0001h
RXF3EIDL_RXF3EID3_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID3_MASK                   equ 0008h
RXF3EIDL_RXF3EID4_POSN                   equ 0004h
RXF3EIDL_RXF3EID4_POSITION               equ 0004h
RXF3EIDL_RXF3EID4_SIZE                   equ 0001h
RXF3EIDL_RXF3EID4_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID4_MASK                   equ 0010h
RXF3EIDL_RXF3EID5_POSN                   equ 0005h
RXF3EIDL_RXF3EID5_POSITION               equ 0005h
RXF3EIDL_RXF3EID5_SIZE                   equ 0001h
RXF3EIDL_RXF3EID5_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID5_MASK                   equ 0020h
RXF3EIDL_RXF3EID6_POSN                   equ 0006h
RXF3EIDL_RXF3EID6_POSITION               equ 0006h
RXF3EIDL_RXF3EID6_SIZE                   equ 0001h
RXF3EIDL_RXF3EID6_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID6_MASK                   equ 0040h
RXF3EIDL_RXF3EID7_POSN                   equ 0007h
RXF3EIDL_RXF3EID7_POSITION               equ 0007h
RXF3EIDL_RXF3EID7_SIZE                   equ 0001h
RXF3EIDL_RXF3EID7_LENGTH                 equ 0001h
RXF3EIDL_RXF3EID7_MASK                   equ 0080h

