GopalSaraf/Practicals/PSDL/include/proc/pic18f2680.inc
#define RXF6EID15                        BANKMASK(RXF6EIDH), 7, b
#define RXF6EID16                        BANKMASK(RXF6SIDL), 0, b
#define RXF6EID17                        BANKMASK(RXF6SIDL), 1, b
#define RXF6EID2                         BANKMASK(RXF6EIDL), 2, b
#define RXF6EID3                         BANKMASK(RXF6EIDL), 3, b
#define RXF6EID4                         BANKMASK(RXF6EIDL), 4, b
#define RXF6EID5                         BANKMASK(RXF6EIDL), 5, b
#define RXF6EID6                         BANKMASK(RXF6EIDL), 6, b
#define RXF6EID7                         BANKMASK(RXF6EIDL), 7, b
#define RXF6EID8                         BANKMASK(RXF6EIDH), 0, b
#define RXF6EID9                         BANKMASK(RXF6EIDH), 1, b
#define RXF6EN                           BANKMASK(RXFCON0), 6, b
#define RXF6EXIDEN                       BANKMASK(RXF6SIDL), 3, b
#define RXF6SID0                         BANKMASK(RXF6SIDL), 5, b
#define RXF6SID1                         BANKMASK(RXF6SIDL), 6, b
#define RXF6SID10                        BANKMASK(RXF6SIDH), 7, b
#define RXF6SID2                         BANKMASK(RXF6SIDL), 7, b
#define RXF6SID3                         BANKMASK(RXF6SIDH), 0, b
#define RXF6SID4                         BANKMASK(RXF6SIDH), 1, b
#define RXF6SID5                         BANKMASK(RXF6SIDH), 2, b
#define RXF6SID6                         BANKMASK(RXF6SIDH), 3, b
#define RXF6SID7                         BANKMASK(RXF6SIDH), 4, b
#define RXF6SID8                         BANKMASK(RXF6SIDH), 5, b
#define RXF6SID9                         BANKMASK(RXF6SIDH), 6, b
#define RXF7EID0                         BANKMASK(RXF7EIDL), 0, b
#define RXF7EID1                         BANKMASK(RXF7EIDL), 1, b
#define RXF7EID10                        BANKMASK(RXF7EIDH), 2, b
#define RXF7EID11                        BANKMASK(RXF7EIDH), 3, b
#define RXF7EID12                        BANKMASK(RXF7EIDH), 4, b
#define RXF7EID13                        BANKMASK(RXF7EIDH), 5, b
#define RXF7EID14                        BANKMASK(RXF7EIDH), 6, b
#define RXF7EID15                        BANKMASK(RXF7EIDH), 7, b
#define RXF7EID16                        BANKMASK(RXF7SIDL), 0, b
#define RXF7EID17                        BANKMASK(RXF7SIDL), 1, b
#define RXF7EID2                         BANKMASK(RXF7EIDL), 2, b
#define RXF7EID3                         BANKMASK(RXF7EIDL), 3, b
#define RXF7EID4                         BANKMASK(RXF7EIDL), 4, b
#define RXF7EID5                         BANKMASK(RXF7EIDL), 5, b
#define RXF7EID6                         BANKMASK(RXF7EIDL), 6, b
#define RXF7EID7                         BANKMASK(RXF7EIDL), 7, b
#define RXF7EID8                         BANKMASK(RXF7EIDH), 0, b
#define RXF7EID9                         BANKMASK(RXF7EIDH), 1, b
#define RXF7EN                           BANKMASK(RXFCON0), 7, b
#define RXF7EXIDEN                       BANKMASK(RXF7SIDL), 3, b
#define RXF7SID0                         BANKMASK(RXF7SIDL), 5, b
#define RXF7SID1                         BANKMASK(RXF7SIDL), 6, b
#define RXF7SID10                        BANKMASK(RXF7SIDH), 7, b
#define RXF7SID2                         BANKMASK(RXF7SIDL), 7, b
#define RXF7SID3                         BANKMASK(RXF7SIDH), 0, b
#define RXF7SID4                         BANKMASK(RXF7SIDH), 1, b
#define RXF7SID5                         BANKMASK(RXF7SIDH), 2, b
#define RXF7SID6                         BANKMASK(RXF7SIDH), 3, b
#define RXF7SID7                         BANKMASK(RXF7SIDH), 4, b
#define RXF7SID8                         BANKMASK(RXF7SIDH), 5, b
#define RXF7SID9                         BANKMASK(RXF7SIDH), 6, b
#define RXF8EID0                         BANKMASK(RXF8EIDL), 0, b
#define RXF8EID1                         BANKMASK(RXF8EIDL), 1, b
#define RXF8EID10                        BANKMASK(RXF8EIDH), 2, b
#define RXF8EID11                        BANKMASK(RXF8EIDH), 3, b
#define RXF8EID12                        BANKMASK(RXF8EIDH), 4, b
#define RXF8EID13                        BANKMASK(RXF8EIDH), 5, b
#define RXF8EID14                        BANKMASK(RXF8EIDH), 6, b
#define RXF8EID15                        BANKMASK(RXF8EIDH), 7, b
#define RXF8EID16                        BANKMASK(RXF8SIDL), 0, b
#define RXF8EID17                        BANKMASK(RXF8SIDL), 1, b
#define RXF8EID2                         BANKMASK(RXF8EIDL), 2, b
#define RXF8EID3                         BANKMASK(RXF8EIDL), 3, b
#define RXF8EID4                         BANKMASK(RXF8EIDL), 4, b
#define RXF8EID5                         BANKMASK(RXF8EIDL), 5, b
#define RXF8EID6                         BANKMASK(RXF8EIDL), 6, b
#define RXF8EID7                         BANKMASK(RXF8EIDL), 7, b
#define RXF8EID8                         BANKMASK(RXF8EIDH), 0, b
#define RXF8EID9                         BANKMASK(RXF8EIDH), 1, b
#define RXF8EN                           BANKMASK(RXFCON1), 0, b
#define RXF8EXIDEN                       BANKMASK(RXF8SIDL), 3, b
#define RXF8SID0                         BANKMASK(RXF8SIDL), 5, b
#define RXF8SID1                         BANKMASK(RXF8SIDL), 6, b
#define RXF8SID10                        BANKMASK(RXF8SIDH), 7, b
#define RXF8SID2                         BANKMASK(RXF8SIDL), 7, b
#define RXF8SID3                         BANKMASK(RXF8SIDH), 0, b
#define RXF8SID4                         BANKMASK(RXF8SIDH), 1, b
#define RXF8SID5                         BANKMASK(RXF8SIDH), 2, b
#define RXF8SID6                         BANKMASK(RXF8SIDH), 3, b
#define RXF8SID7                         BANKMASK(RXF8SIDH), 4, b
#define RXF8SID8                         BANKMASK(RXF8SIDH), 5, b
#define RXF8SID9                         BANKMASK(RXF8SIDH), 6, b
#define RXF9EID0                         BANKMASK(RXF9EIDL), 0, b
#define RXF9EID1                         BANKMASK(RXF9EIDL), 1, b
#define RXF9EID10                        BANKMASK(RXF9EIDH), 2, b
#define RXF9EID11                        BANKMASK(RXF9EIDH), 3, b
#define RXF9EID12                        BANKMASK(RXF9EIDH), 4, b
#define RXF9EID13                        BANKMASK(RXF9EIDH), 5, b
#define RXF9EID14                        BANKMASK(RXF9EIDH), 6, b
#define RXF9EID15                        BANKMASK(RXF9EIDH), 7, b
#define RXF9EID16                        BANKMASK(RXF9SIDL), 0, b
#define RXF9EID17                        BANKMASK(RXF9SIDL), 1, b
#define RXF9EID2                         BANKMASK(RXF9EIDL), 2, b
#define RXF9EID3                         BANKMASK(RXF9EIDL), 3, b
#define RXF9EID4                         BANKMASK(RXF9EIDL), 4, b
#define RXF9EID5                         BANKMASK(RXF9EIDL), 5, b
#define RXF9EID6                         BANKMASK(RXF9EIDL), 6, b
#define RXF9EID7                         BANKMASK(RXF9EIDL), 7, b
#define RXF9EID8                         BANKMASK(RXF9EIDH), 0, b
#define RXF9EID9                         BANKMASK(RXF9EIDH), 1, b
#define RXF9EN                           BANKMASK(RXFCON1), 1, b
#define RXF9EXIDEN                       BANKMASK(RXF9SIDL), 3, b
#define RXF9SID0                         BANKMASK(RXF9SIDL), 5, b
#define RXF9SID1                         BANKMASK(RXF9SIDL), 6, b
#define RXF9SID10                        BANKMASK(RXF9SIDH), 7, b
#define RXF9SID2                         BANKMASK(RXF9SIDL), 7, b
#define RXF9SID3                         BANKMASK(RXF9SIDH), 0, b
#define RXF9SID4                         BANKMASK(RXF9SIDH), 1, b
#define RXF9SID5                         BANKMASK(RXF9SIDH), 2, b
#define RXF9SID6                         BANKMASK(RXF9SIDH), 3, b
#define RXF9SID7                         BANKMASK(RXF9SIDH), 4, b
#define RXF9SID8                         BANKMASK(RXF9SIDH), 5, b
#define RXF9SID9                         BANKMASK(RXF9SIDH), 6, b
#define RXM0EID0                         BANKMASK(RXM0EIDL), 0, b
#define RXM0EID1                         BANKMASK(RXM0EIDL), 1, b
#define RXM0EID10                        BANKMASK(RXM0EIDH), 2, b
#define RXM0EID11                        BANKMASK(RXM0EIDH), 3, b
#define RXM0EID12                        BANKMASK(RXM0EIDH), 4, b
#define RXM0EID13                        BANKMASK(RXM0EIDH), 5, b
#define RXM0EID14                        BANKMASK(RXM0EIDH), 6, b
#define RXM0EID15                        BANKMASK(RXM0EIDH), 7, b
#define RXM0EID16                        BANKMASK(RXM0SIDL), 0, b
#define RXM0EID17                        BANKMASK(RXM0SIDL), 1, b
#define RXM0EID2                         BANKMASK(RXM0EIDL), 2, b
#define RXM0EID3                         BANKMASK(RXM0EIDL), 3, b
#define RXM0EID4                         BANKMASK(RXM0EIDL), 4, b
#define RXM0EID5                         BANKMASK(RXM0EIDL), 5, b
#define RXM0EID6                         BANKMASK(RXM0EIDL), 6, b
#define RXM0EID7                         BANKMASK(RXM0EIDL), 7, b
#define RXM0EID8                         BANKMASK(RXM0EIDH), 0, b
#define RXM0EID9                         BANKMASK(RXM0EIDH), 1, b
#define RXM0EXIDM                        BANKMASK(RXM0SIDL), 3, b
#define RXM0SID0                         BANKMASK(RXM0SIDL), 5, b
#define RXM0SID1                         BANKMASK(RXM0SIDL), 6, b
#define RXM0SID10                        BANKMASK(RXM0SIDH), 7, b
#define RXM0SID2                         BANKMASK(RXM0SIDL), 7, b
#define RXM0SID3                         BANKMASK(RXM0SIDH), 0, b
#define RXM0SID4                         BANKMASK(RXM0SIDH), 1, b
#define RXM0SID5                         BANKMASK(RXM0SIDH), 2, b
#define RXM0SID6                         BANKMASK(RXM0SIDH), 3, b
#define RXM0SID7                         BANKMASK(RXM0SIDH), 4, b
#define RXM0SID8                         BANKMASK(RXM0SIDH), 5, b
#define RXM0SID9                         BANKMASK(RXM0SIDH), 6, b
#define RXM1EID0                         BANKMASK(RXM1EIDL), 0, b
#define RXM1EID1                         BANKMASK(RXM1EIDL), 1, b
#define RXM1EID10                        BANKMASK(RXM1EIDH), 2, b
#define RXM1EID11                        BANKMASK(RXM1EIDH), 3, b
#define RXM1EID12                        BANKMASK(RXM1EIDH), 4, b
#define RXM1EID13                        BANKMASK(RXM1EIDH), 5, b
#define RXM1EID14                        BANKMASK(RXM1EIDH), 6, b
#define RXM1EID15                        BANKMASK(RXM1EIDH), 7, b
#define RXM1EID16                        BANKMASK(RXM1SIDL), 0, b
#define RXM1EID17                        BANKMASK(RXM1SIDL), 1, b
#define RXM1EID2                         BANKMASK(RXM1EIDL), 2, b
#define RXM1EID3                         BANKMASK(RXM1EIDL), 3, b
#define RXM1EID4                         BANKMASK(RXM1EIDL), 4, b
#define RXM1EID5                         BANKMASK(RXM1EIDL), 5, b
#define RXM1EID6                         BANKMASK(RXM1EIDL), 6, b
#define RXM1EID7                         BANKMASK(RXM1EIDL), 7, b
#define RXM1EID8                         BANKMASK(RXM1EIDH), 0, b
#define RXM1EID9                         BANKMASK(RXM1EIDH), 1, b
#define RXM1EXIDEN                       BANKMASK(RXM1SIDL), 3, b
#define RXM1SID0                         BANKMASK(RXM1SIDL), 5, b
#define RXM1SID1                         BANKMASK(RXM1SIDL), 6, b
#define RXM1SID10                        BANKMASK(RXM1SIDH), 7, b
#define RXM1SID2                         BANKMASK(RXM1SIDL), 7, b
#define RXM1SID3                         BANKMASK(RXM1SIDH), 0, b
#define RXM1SID4                         BANKMASK(RXM1SIDH), 1, b
#define RXM1SID5                         BANKMASK(RXM1SIDH), 2, b
#define RXM1SID6                         BANKMASK(RXM1SIDH), 3, b
#define RXM1SID7                         BANKMASK(RXM1SIDH), 4, b
#define RXM1SID8                         BANKMASK(RXM1SIDH), 5, b
#define RXM1SID9                         BANKMASK(RXM1SIDH), 6, b
#define RXWARN                           BANKMASK(COMSTAT), 1, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SAM                              BANKMASK(BRGCON2), 6, a
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCK                              BANKMASK(PORTC), 3, a
#define SCKP                             BANKMASK(BAUDCON), 4, a
#define SCL                              BANKMASK(PORTC), 3, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 5, a
#define SEG1PH0                          BANKMASK(BRGCON2), 3, a
#define SEG1PH1                          BANKMASK(BRGCON2), 4, a
#define SEG1PH2                          BANKMASK(BRGCON2), 5, a
#define SEG2PH0                          BANKMASK(BRGCON3), 0, a
#define SEG2PH1                          BANKMASK(BRGCON3), 1, a
#define SEG2PH2                          BANKMASK(BRGCON3), 2, a
#define SEG2PHT                          BANKMASK(BRGCON2), 7, a
#define SEG2PHTS                         BANKMASK(BRGCON2), 7, a
#define SEN                              BANKMASK(SSPCON2), 0, a
#define SENDB                            BANKMASK(TXSTA), 3, a
#define SENDB1                           BANKMASK(TXSTA), 3, a
#define SJW0                             BANKMASK(BRGCON1), 6, a
#define SJW1                             BANKMASK(BRGCON1), 7, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SPEN                             BANKMASK(RCSTA), 7, a
#define SREN                             BANKMASK(RCSTA), 5, a
#define SRENA                            BANKMASK(RCSTA), 5, a
#define SS                               BANKMASK(PORTA), 5, a
#define SSPEN                            BANKMASK(SSPCON1), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON1), 0, a
#define SSPM1                            BANKMASK(SSPCON1), 1, a
#define SSPM2                            BANKMASK(SSPCON1), 2, a
#define SSPM3                            BANKMASK(SSPCON1), 3, a
#define SSPOV                            BANKMASK(SSPCON1), 6, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA), 4, a
#define SYNC1                            BANKMASK(TXSTA), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTA), 4, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0PS3                            BANKMASK(T0CON), 3, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T13CKI                           BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1INSYNC                         BANKMASK(T1CON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T1RUN                            BANKMASK(T1CON), 6, a
#define T1SYNC                           BANKMASK(T1CON), 2, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CCP1                           BANKMASK(T3CON), 3, a
#define T3CCP2                           BANKMASK(T3CON), 6, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3ECCP1                          BANKMASK(T3CON), 6, a
#define T3NSYNC                          BANKMASK(T3CON), 2, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T3SYNC                           BANKMASK(T3CON), 2, a
#define TEC0                             BANKMASK(TXERRCNT), 0, a
#define TEC1                             BANKMASK(TXERRCNT), 1, a
#define TEC2                             BANKMASK(TXERRCNT), 2, a
#define TEC3                             BANKMASK(TXERRCNT), 3, a
#define TEC4                             BANKMASK(TXERRCNT), 4, a
#define TEC5                             BANKMASK(TXERRCNT), 5, a
#define TEC6                             BANKMASK(TXERRCNT), 6, a
#define TEC7                             BANKMASK(TXERRCNT), 7, a
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS                           BANKMASK(T1CON), 1, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR3CS                           BANKMASK(T3CON), 1, a
#define TMR3IE                           BANKMASK(PIE2), 1, a
#define TMR3IF                           BANKMASK(PIR2), 1, a
#define TMR3IP                           BANKMASK(IPR2), 1, a
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TO                               BANKMASK(RCON), 3, a
#define TOUTPS0                          BANKMASK(T2CON), 3, a
#define TOUTPS1                          BANKMASK(T2CON), 4, a
#define TOUTPS2                          BANKMASK(T2CON), 5, a
#define TOUTPS3                          BANKMASK(T2CON), 6, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRMT                             BANKMASK(TXSTA), 1, a
#define TRMT1                            BANKMASK(TXSTA), 1, a
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TX                               BANKMASK(PORTC), 6, a
#define TX0IE                            BANKMASK(TXBIE), 2, b
#define TX0IF                            BANKMASK(TXB0CON), 7, b
#define TX1IE                            BANKMASK(TXBIE), 3, b
#define TX1IF                            BANKMASK(TXB1CON), 7, b
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX2IE                            BANKMASK(TXBIE), 4, b
#define TX2IF                            BANKMASK(TXB2CON), 7, b
#define TX8_9                            BANKMASK(TXSTA), 6, a
#define TX9                              BANKMASK(TXSTA), 6, a
#define TX91                             BANKMASK(TXSTA), 6, a
#define TX9D                             BANKMASK(TXSTA), 0, a
#define TX9D1                            BANKMASK(TXSTA), 0, a
#define TXB0ABT                          BANKMASK(TXB0CON), 6, b
#define TXB0D00                          BANKMASK(TXB0D0), 0, b
#define TXB0D01                          BANKMASK(TXB0D0), 1, b
#define TXB0D02                          BANKMASK(TXB0D0), 2, b
#define TXB0D03                          BANKMASK(TXB0D0), 3, b
#define TXB0D04                          BANKMASK(TXB0D0), 4, b
#define TXB0D05                          BANKMASK(TXB0D0), 5, b
#define TXB0D06                          BANKMASK(TXB0D0), 6, b
#define TXB0D07                          BANKMASK(TXB0D0), 7, b
#define TXB0D10                          BANKMASK(TXB0D1), 0, b
#define TXB0D11                          BANKMASK(TXB0D1), 1, b
#define TXB0D12                          BANKMASK(TXB0D1), 2, b
#define TXB0D13                          BANKMASK(TXB0D1), 3, b
#define TXB0D14                          BANKMASK(TXB0D1), 4, b
#define TXB0D15                          BANKMASK(TXB0D1), 5, b
#define TXB0D16                          BANKMASK(TXB0D1), 6, b
#define TXB0D17                          BANKMASK(TXB0D1), 7, b
#define TXB0D20                          BANKMASK(TXB0D2), 0, b
#define TXB0D21                          BANKMASK(TXB0D2), 1, b
#define TXB0D22                          BANKMASK(TXB0D2), 2, b
#define TXB0D23                          BANKMASK(TXB0D2), 3, b
#define TXB0D24                          BANKMASK(TXB0D2), 4, b
#define TXB0D25                          BANKMASK(TXB0D2), 5, b
#define TXB0D26                          BANKMASK(TXB0D2), 6, b
#define TXB0D27                          BANKMASK(TXB0D2), 7, b
#define TXB0D30                          BANKMASK(TXB0D3), 0, b
